<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the paginator library to build
    | the simple pagination links You are free to change them to anything
    | you want to customize your views to better match your application
    |
    */
    'published_before' => ' لقد تم نشر هذا الامتحان مسبقاً',
    'closed_exam' => ' لا يمكن نشر الامتحانات المغلقة من فضلك قم بتنشيطه',
    'exist_appointments' => ' لا يمكن إجراء تغييرات على هذا الموعد',
    'distinct_appointment' => 'تم إدخال هذا الموعد مسبقا',
    'closed_teacher' => ' لا يقبل هذا المدرس طلبات تسجيل فى الوقت الحالى',
    'process_completed' => 'لقد تمت هذه العملية من قبل',
    'not_in_responds' => ' الاجابة الصحيحة غير موجودة فى الاختيارات',
    'invalid_appointment' => ' الموعد الذي تم إدخاله غير مسموح به',
    'published' => ' لا يمكن إجراء تغييرات بعد نشر الامتحان ',
    'closed_appointment' => ' لقد تم غلق التسجيل في الموعد المختار',
    'package_limit' => ' لقد تخطيت الحد الاقصي لإضافة الطلاب  لكى تتمكن من إضافة المزيد من فضلك قم بالتحديث إلي خطة أسعار أعلي عن طريق فريق أستاذي',
    'appointment_limit' => ' لقد تخطيت الحد الاقصي لإضافة المواعيد  لكى تتمكن من إضافة المزيد من فضلك قم بالتحديث إلي خطة أسعار أعلي عن طريق فريق أستاذي',
    'exams_limit' => ' لقد تخطيت الحد الاقصي لإضافة الامتحانات  لكى تتمكن من إضافة المزيد من فضلك قم بالتحديث إلي خطة أسعار أعلي عن طريق فريق أستاذي',
    'not_allowed'  => 'غير مسموح بهذه العملية',
    'max_questions' => 'الحد الاقصى لعدد الاسألة المسموح به للامتحان الواحد ',
    'invalid_exam_year' => 'السنة الدراسية المختارة غير مسموحة لهذا الامتحان',
    'not_waiting' => 'لقد قمت بالدخول إلى هذا الامتحان مسبقاً',
    'not_in_exam' => 'لقد انتهى وقت هذا الامتحان',
    'exam_is_off' => 'لقد قام المعلم بغلق هذا الامتحان',
    'must_start_exam' => 'من فضلك قم ببدء الامتحان أولاً',
    'wrong_questions_no' => 'عدد الحلول غير مطابق لعدد الاسألة',
    'distinct_respond' => 'من فضلك اختر الاسألة الإختيارية من الإختيارات المتاحة',
    'exam_once' => 'لا يمكن إمتحان إمتحانين فى نفس الوقت',
    'no_appointments' => 'لا يوجد مجموعات لهذا الصف',
    'invalid_appointments' => 'قم باختيار مجموعة او أكثر',
    'no_published_students' => 'لقد تم النشر لجميع الطلاب الموجودين فى المجموعات المختارة',
    'empty_exam' => 'أدخل أسالة فى الامتحان أولا لكى تتمكن من نشره',
    'question_not_found' => 'أحد الاسألة غير موجود بهذا الامتحان',
    'student_subscribed' => 'لقد تم التسجيل عند هذا المدرس فيما سبق',
];
